Revit 2027 API
ParameterTypeId.MoveConstrain Property
 "Constrain"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MoveConstrain { get; }
Public Shared ReadOnly Property MoveConstrain As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MoveConstrain {
	ForgeTypeId^ get ();
}
static member MoveConstrain : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace